Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.ValueEnteredEventArgs`1
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.ValueEnteredEventArgs`1 provides the event arguments for when a value has been entered.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.ValueEnteredEventArgs`1.#ctor(`0)
Initializes a new instance of Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.ValueEnteredEventArgs`1.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.ValueEnteredEventArgs`1.Value
Gets the entered value.